Revit 2027 API
DuctPressureDropData.Shape Property
 The profile type of the duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType Shape { get; }
Public ReadOnly Property Shape As ConnectorProfileType
	Get
public:
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
member Shape : ConnectorProfileType with get
Property Value
ConnectorProfileType
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace